
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 12 to add, 7 to change, 12 to destroy.</code></pre>

* Update
  * azurerm_api_management_subscription.product[0]
  * module.action-group.azurerm_resource_group_template_deployment.action-group
  * module.apim_product[0].azurerm_api_management_product.product
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects_trigger_once
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;shared-storageaccount-connection-string&#34;]
  * module.redis-v6.azurerm_redis_cache.redis
* Replace
  * azurerm_storage_blob.b2c_policy_files[&#34;admin-mfa-cy-GB.html&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;admin-mfa-en.html&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;admin-mfa.css&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;login-cy-GB.html&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;login-en.html&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;login.css&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;reset-pw-cy-GB.html&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;reset-pw-en.html&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;reset-pw.css&#34;]
  * module.sa.azapi_update_resource.defender_settings
  * module.sa.azurerm_role_assignment.storage-account-role-assignment[&#34;Storage Blob Data Contributor&#34;]
  * module.sa.azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.product[0] will be updated in-place
  ~ resource "azurerm_api_management_subscription" "product" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/subscriptions/d5a0ba59-f5ac-4e05-9650-2e5734c17e29"
        # (8 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_policy_files["admin-mfa-cy-GB.html"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_policy_files" {
      ~ access_tier            = "Cool" -> (known after apply)
      ~ id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/admin-mfa-cy-GB.html" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "admin-mfa-cy-GB.html"
      ~ source_content         = <<-EOT # forces replacement
            <html lang="en" class="govuk-template ">
            <head>
              <meta charset="utf-8">
              <title>
                Mewngofnod
              </title>
              <meta name="viewport" content="width=device-width, initial-scale=1, viewport-fit=cover">
              <meta name="theme-color" content="#0b0c0c">
              <link rel="shortcut icon" sizes="16x16 32x32 48x48" href="https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/favicon.ico"
                    type="image/x-icon">
              <meta http-equiv="X-UA-Compatible" content="IE=edge">
            </head>
            <body>
            <script>document.body.className = ((document.body.className) ? document.body.className + ' js-enabled' : 'js-enabled');</script>
            
            <a href="#main-content" class="govuk-skip-link">Skip to main content</a>
            
            <header class="govuk-header " role="banner" data-module="govuk-header">
              <div class="govuk-header__container govuk-width-container">
                <div class="govuk-header__logo">
                  <a href="https://www.gov.uk/" class="govuk-header__link govuk-header__link--homepage">
                    <span class="govuk-header__logotype">
                      <img src="https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/logo_gov.png" height="30" width="36"
                           class="govuk-header__logotype-crown-fallback-image"/>
                      <span class="govuk-header__logotype-text">
                        GOV.UK
                      </span>
                    </span>
                  </a>
                </div>
                <div class="govuk-header__content">
                  <a href="https://pip-frontend.staging.platform.hmcts.net/view-option" class="govuk-header__link govuk-header__link--service-name">
                    Gwrandawiadau llys a thribiwnlys
                  </a>
                </div>
              </div>
            </header>
            
            
            <div class="govuk-width-container ">
              <div class="govuk-phase-banner">
                <p class="govuk-phase-banner__content">
                  <strong class="govuk-tag govuk-phase-banner__content__tag">
                    beta
                  </strong>
                  <span class="govuk-phase-banner__text">
                  Mae hwn yn wasanaeth newydd – bydd eich <a id="betalink" class="govuk-link" href="https://www.smartsurvey.co.uk/s/FBSPI22/?pageurl=b2c/admin-mfa">adborth</a> yn ein helpu i’w wella.
                </span>
                </p>
              </div>
            
              <nav class="moj-sub-navigation pub-navigation govuk-!-margin-bottom-0" aria-label="Primary navigation">
            
                <ul class="moj-sub-navigation__list">
                  <li class="moj-sub-navigation__item">
                    <a class="moj-sub-navigation__link" href="https://pip-frontend.staging.platform.hmcts.net/view-option">Tudalen hafan</a>
                </ul>
              </nav>
            
              <main class="govuk-main-wrapper " id="main-content" role="main">
            
                <link href="https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/login.css" rel="stylesheet">
                <link href="https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/admin-mfa.css" rel="stylesheet">
                <div class="row">
                  <div class="col1">
                    <div id="api">
                    </div>
                  </div>
                  <div class="col2">
                  </div>
                </div>
              </main>
            </div>
            
            <footer class="govuk-footer " role="contentinfo">
              <div class="govuk-width-container ">
            
                <div class="govuk-footer__meta">
                  <div class="govuk-footer__meta-item govuk-footer__meta-item--grow">
            
                    <h2 class="govuk-visually-hidden">Support links</h2>
            
                    <ul class="govuk-footer__inline-list">
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://gov.uk/help">
                          Gymorth
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://gov.uk/help/privacy-notice">
                          Preifatrwydd
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://pip-frontend.staging.platform.hmcts.net/Cookie-policy">
                          Cwcis
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://pip-frontend.staging.platform.hmcts.net/accessibility-statement">
                          Datganiad hygyrchedd
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://gov.uk/contact">
                          Cysylltwch
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://www.gov.uk/help/terms-conditions">
                          Telerau ac amodau
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://www.gov.uk/cymraeg">
                          Cymraeg
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://www.gov.uk/government/organisations/government-digital-service">
                          Gwasanaeth Digidol y Llywodraeth
                        </a>
                      </li>
                    </ul>
            
                    <img src="https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/copyright.png" height="17" width="41"
                         class="govuk-footer__licence-logo"/>
                    <span class="govuk-footer__licence-description">
                      All content is available under the
                      <a class="govuk-footer__link"
                         href="https://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/" rel="license">Open Government Licence v3.0</a>, except where otherwise stated
                    </span>
                    <p class="govuk-footer__licence-description">When you use this information under the OGL,
                      you should include the following attribution: Contains public sector information licensed under the
                      <a class="govuk-footer__link"
                         href="https://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/"
                         rel="license">Open Government Licence v3.0</a>
                    </p>
                    <p class="govuk-footer__licence-description govuk-!-margin-0">The
                      <a class="govuk-footer__link"
                         href="https://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/"
                         rel="license">Open Government Licence v3.0</a> does not cover use of any personal data in the
                         court and tribunal hearings service. Personal data is subject to applicable data protection laws.
                    </p>
                  </div>
                  <div class="govuk-footer__meta-item">
                    <a class="govuk-footer__link govuk-footer__copyright-logo"
                       href="https://www.nationalarchives.gov.uk/information-management/re-using-public-sector-information/uk-government-licensing-framework/crown-copyright/">©
                      Crown copyright</a>
                  </div>
                </div>
              </div>
            </footer>
            
            <script>
              function modalTimeoutCallback() {
                setTimeout(
                  function() {
                    const modalOverlay = document.getElementById('simplemodal-overlay');
                    const modalContainer = document.getElementById('simplemodal-container');
            
                    if (document.contains(modalOverlay) && document.contains(modalContainer)) {
                      modalOverlay.style.setProperty('display', 'block', 'important');
                      modalContainer.style.setProperty('display', 'block', 'important');
                    }
                  }, 5000);
              }
            
              const timeoutConfig = {
                attributes: true,
                attributeFilter: ["id"],
                attributeOldValue: true
              };
            
              const timeoutObserver = new MutationObserver(modalTimeoutCallback);
              const verifyingModal = document.getElementsByClassName("verifying-modal");
              timeoutObserver.observe(verifyingModal[0], timeoutConfig);
            </script>
            
            </body>
            </html>
        EOT -> (known after apply) # forces replacement
      ~ url                    = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/admin-mfa-cy-GB.html" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_policy_files["admin-mfa-en.html"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_policy_files" {
      ~ access_tier            = "Cool" -> (known after apply)
      ~ id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/admin-mfa-en.html" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "admin-mfa-en.html"
      ~ source_content         = <<-EOT # forces replacement
            <html lang="en" class="govuk-template ">
            <head>
              <meta charset="utf-8">
              <title>
                Login
              </title>
              <meta name="viewport" content="width=device-width, initial-scale=1, viewport-fit=cover">
              <meta name="theme-color" content="#0b0c0c">
              <link rel="shortcut icon" sizes="16x16 32x32 48x48" href="https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/favicon.ico"
                    type="image/x-icon">
              <meta http-equiv="X-UA-Compatible" content="IE=edge">
            </head>
            <body>
            <script>document.body.className = ((document.body.className) ? document.body.className + ' js-enabled' : 'js-enabled');</script>
            
            <a href="#main-content" class="govuk-skip-link">Skip to main content</a>
            
            <header class="govuk-header " role="banner" data-module="govuk-header">
              <div class="govuk-header__container govuk-width-container">
                <div class="govuk-header__logo">
                  <a href="https://www.gov.uk/" class="govuk-header__link govuk-header__link--homepage">
                    <span class="govuk-header__logotype">
                      <img src="https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/logo_gov.png" height="30" width="36"
                           class="govuk-header__logotype-crown-fallback-image"/>
                      <span class="govuk-header__logotype-text">
                        GOV.UK
                      </span>
                    </span>
                  </a>
                </div>
                <div class="govuk-header__content">
                  <a href="https://pip-frontend.staging.platform.hmcts.net/view-option" class="govuk-header__link govuk-header__link--service-name">
                    Court and tribunal hearings
                  </a>
                </div>
              </div>
            </header>
            
            
            <div class="govuk-width-container ">
              <div class="govuk-phase-banner">
                <p class="govuk-phase-banner__content">
                  <strong class="govuk-tag govuk-phase-banner__content__tag">
                    beta
                  </strong>
                  <span class="govuk-phase-banner__text">
                  This is a new service – your <a id="betalink" class="govuk-link" href="https://www.smartsurvey.co.uk/s/FBSPI22/?pageurl=b2c/admin-mfa">feedback</a> will help us to improve it.
                </span>
                </p>
              </div>
            
              <nav class="moj-sub-navigation pub-navigation govuk-!-margin-bottom-0" aria-label="Primary navigation">
            
                <ul class="moj-sub-navigation__list">
                  <li class="moj-sub-navigation__item">
                    <a class="moj-sub-navigation__link" href="https://pip-frontend.staging.platform.hmcts.net/view-option">Home</a>
                </ul>
              </nav>
            
              <main class="govuk-main-wrapper " id="main-content" role="main">
            
                <link href="https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/login.css" rel="stylesheet">
                <link href="https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/admin-mfa.css" rel="stylesheet">
                <div class="row">
                  <div class="col1">
                    <div id="api">
                    </div>
                  </div>
                  <div class="col2">
                  </div>
                </div>
              </main>
            </div>
            
            <footer class="govuk-footer " role="contentinfo">
              <div class="govuk-width-container ">
            
                <div class="govuk-footer__meta">
                  <div class="govuk-footer__meta-item govuk-footer__meta-item--grow">
            
                    <h2 class="govuk-visually-hidden">Support links</h2>
            
                    <ul class="govuk-footer__inline-list">
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://gov.uk/help">
                          Help
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://gov.uk/help/privacy-notice">
                          Privacy
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://pip-frontend.staging.platform.hmcts.net/Cookie-policy">
                          Cookies
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://pip-frontend.staging.platform.hmcts.net/accessibility-statement">
                          Accessibility statement
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://gov.uk/contact">
                          Contact
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://www.gov.uk/help/terms-conditions">
                          Terms and conditions
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://www.gov.uk/cymraeg">
                          Welsh
                        </a>
                      </li>
                      <li class="govuk-footer__inline-list-item">
                        <a class="govuk-footer__link" href="https://www.gov.uk/government/organisations/government-digital-service">
                          Government Digital Service
                        </a>
                      </li>
                    </ul>
            
                    <img src="https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/copyright.png" height="17" width="41"
                         class="govuk-footer__licence-logo"/>
                    <span class="govuk-footer__licence-description">
                      All content is available under the
                      <a class="govuk-footer__link"
                         href="https://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/" rel="license">Open Government Licence v3.0</a>, except where otherwise stated
                    </span>
                    <p class="govuk-footer__licence-description">When you use this information under the OGL,
                      you should include the following attribution: Contains public sector information licensed under the
                      <a class="govuk-footer__link"
                         href="https://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/"
                         rel="license">Open Government Licence v3.0</a>
                    </p>
                    <p class="govuk-footer__licence-description govuk-!-margin-0">The
                      <a class="govuk-footer__link"
                         href="https://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/"
                         rel="license">Open Government Licence v3.0</a> does not cover use of any personal data in the
                         court and tribunal hearings service. Personal data is subject to applicable data protection laws.
                    </p>
                  </div>
                  <div class="govuk-footer__meta-item">
                    <a class="govuk-footer__link govuk-footer__copyright-logo"
                       href="https://www.nationalarchives.gov.uk/information-management/re-using-public-sector-information/uk-government-licensing-framework/crown-copyright/">©
                      Crown copyright</a>
                  </div>
                </div>
              </div>
            </footer>
            
            <script>
              function modalTimeoutCallback() {
                setTimeout(
                  function() {
                    const modalOverlay = document.getElementById('simplemodal-overlay');
                    const modalContaine

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

ng: border-box;
              width: 250px;
              height: 40px;
              margin-top: 0;
              padding: 5px;
              border: 2px solid #0b0c0c;
              border-radius: 0;
              -webkit-appearance: none;
              -moz-appearance: none;
              appearance: none;
            }
            
            .govuk-input, .verifyInput, .textInput, .verificationControlContent {
              margin-left: -40px;
            }
            
            .attrEntry {
              padding-bottom: 25px;
            }
            
            .entry-item label, .attrEntry label {
              font-size: 19px;
              font-size: 1.1875rem;
              line-height: 1.31579;
              font-family: "GDS Transport", arial, sans-serif;
              -webkit-font-smoothing: antialiased;
              -moz-osx-font-smoothing: grayscale;
              font-weight: 400;
              line-height: 1.25;
              color: #0b0c0c;
              display: block;
              margin-bottom: 5px;
            }
            
             .attrEntry label, .passwordAdvice {
               margin-left: -40px;
             }
             .password-label {
               margin-bottom: 10px;
             }
             .password-label a {
               color: #0b0c0c;
               font-family: "GDS Transport", arial, sans-serif;
               -webkit-font-smoothing: antialiased;
               -moz-osx-font-smoothing: grayscale;
               font-weight: 400;
               font-size: 16px;
               font-size: 1rem;
               line-height: 1.25;
               margin-top: 0;
               margin-bottom: 15px;
               font-size: 1.1875rem;
               line-height: 1.31579;
               margin-bottom: 20px;
               color: #1d70b8;
               font-family: "GDS Transport", arial, sans-serif;
               -webkit-font-smoothing: antialiased;
               -moz-osx-font-smoothing: grayscale;
               text-decoration: underline;
               cursor: pointer;
             }
            
            html {
              background: #f3f2f1;
            }
            
            body {
              margin: 0;
              background-color: #ffffff;
            }
            
            .attr ul {
              list-style: none;
            }
            
            .intro p {
              display: block;
              font-size: 1.5em;
              margin-block-start: 0.83em;
              margin-block-end: 0.83em;
              margin-inline-start: 0px;
              margin-inline-end: 0px;
              font-weight: bold;
            }
            
            h1 {
              display: none;
            }
            
            #emailVerificationControl_error_message {
              color: #d4351c;
            }
            
            #emailVerificationControl_but_change_claims {
              display: none !important;
              visibility: hidden;
            }
            
            #cancel, .buttons .sendNewCode {
              margin-top: 10px;
              background: none;
              border: none;
              padding: 0;
              text-decoration: underline;
              box-shadow: none;
              color: #1d70b8;
            }
            
            #cancel:hover, .buttons .sendNewCode:hover {
              color: #003078;
              background-color: white;
              text-decoration: underline;
              text-decoration-thickness: 3px;
            }
            
            #simplemodal-overlay, #simplemodal-container {
              display: none !important;
            }
        EOT -> (known after apply) # forces replacement
      ~ url                    = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/reset-pw.css" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Resources/deployments/CaTH-Group"
        name                = "CaTH-Group"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.apim_product[0].azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/pip-product-stg"
      ~ subscriptions_limit   = 0 -> 20
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/schedules/rotate-client-secrets-schedule"
        name                    = "rotate-client-secrets-schedule"
      ~ start_time              = "2024-03-19T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects_trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects_trigger_once" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/schedules/rotate-client-secrets-schedule-single-trigger"
        name                    = "rotate-client-secrets-schedule-single-trigger"
      ~ start_time              = "2024-03-18T12:31:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["shared-storageaccount-connection-string"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/shared-storageaccount-connection-string/f4c0b02ffdf84eeeb6ea24e78f2f40a4"
        name                    = "shared-storageaccount-connection-string"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.redis-v6.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-v6-cache-stg/providers/Microsoft.Cache/redis/pip-v6-stg"
        name                          = "pip-v6-stg"
        tags                          = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (21 unchanged attributes hidden)

      ~ redis_configuration {
          + data_persistence_authentication_method  = "SAS"
            # (11 unchanged attributes hidden)
        }
    }

  # module.sa.azapi_update_resource.defender_settings must be replaced
-/+ resource "azapi_update_resource" "defender_settings" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Storage/storageAccounts/pipsssastg/providers/Microsoft.Security/DefenderForStorageSettings/current" -> (known after apply)
        name                    = "current"
      ~ output                  = jsonencode({}) -> (known after apply)
      ~ parent_id               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Storage/storageAccounts/pipsssastg" # forces replacement -> (known after apply) # forces replacement
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Storage/storageAccounts/pipsssastg/providers/Microsoft.Security/DefenderForStorageSettings/current" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.sa.azurerm_role_assignment.storage-account-role-assignment["Storage Blob Data Contributor"] must be replaced
-/+ resource "azurerm_role_assignment" "storage-account-role-assignment" {
      ~ id                               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Storage/storageAccounts/pipsssastg/providers/Microsoft.Authorization/roleAssignments/6130cfc1-4605-f37f-8b33-e63be36c42ce" -> (known after apply)
      ~ name                             = "6130cfc1-4605-f37f-8b33-e63be36c42ce" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      ~ scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Storage/storageAccounts/pipsssastg" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sa.azurerm_storage_account.storage_account must be replaced
-/+ resource "azurerm_storage_account" "storage_account" {
      + dns_endpoint_type                  = "Standard" # forces replacement
      ~ id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Storage/storageAccounts/pipsssastg" -> (known after apply)
      + large_file_share_enabled           = (known after apply)
        name                               = "pipsssastg"
      ~ primary_access_key                 = (sensitive value)
      ~ primary_blob_connection_string     = (sensitive value)
      ~ primary_blob_endpoint              = "https://pipsssastg.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                  = "pipsssastg.blob.core.windows.net" -> (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      ~ primary_connection_string          = (sensitive value)
      ~ primary_dfs_endpoint               = "https://pipsssastg.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                   = "pipsssastg.dfs.core.windows.net" -> (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      ~ primary_file_endpoint              = "https://pipsssastg.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                  = "pipsssastg.file.core.windows.net" -> (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      ~ primary_location                   = "uksouth" -> (known after apply)
      ~ primary_queue_endpoint             = "https://pipsssastg.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                 = "pipsssastg.queue.core.windows.net" -> (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      ~ primary_table_endpoint             = "https://pipsssastg.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                 = "pipsssastg.table.core.windows.net" -> (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      ~ primary_web_endpoint               = "https://pipsssastg.z33.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                   = "pipsssastg.z33.web.core.windows.net" -> (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      ~ secondary_access_key               = (sensitive value)
      ~ secondary_blob_connection_string   = (sensitive value)
      ~ secondary_blob_endpoint            = "https://pipsssastg-secondary.blob.core.windows.net/" -> (known after apply)
      ~ secondary_blob_host                = "pipsssastg-secondary.blob.core.windows.net" -> (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      ~ secondary_connection_string        = (sensitive value)
      ~ secondary_dfs_endpoint             = "https://pipsssastg-secondary.dfs.core.windows.net/" -> (known after apply)
      ~ secondary_dfs_host                 = "pipsssastg-secondary.dfs.core.windows.net" -> (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      ~ secondary_location                 = "ukwest" -> (known after apply)
      ~ secondary_queue_endpoint           = "https://pipsssastg-secondary.queue.core.windows.net/" -> (known after apply)
      ~ secondary_queue_host               = "pipsssastg-secondary.queue.core.windows.net" -> (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      ~ secondary_table_endpoint           = "https://pipsssastg-secondary.table.core.windows.net/" -> (known after apply)
      ~ secondary_table_host               = "pipsssastg-secondary.table.core.windows.net" -> (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      ~ secondary_web_endpoint             = "https://pipsssastg-secondary.z33.web.core.windows.net/" -> (known after apply)
      ~ secondary_web_host                 = "pipsssastg-secondary.z33.web.core.windows.net" -> (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
        tags                               = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (20 unchanged attributes hidden)

      ~ blob_properties {
          - change_feed_retention_in_days = 0 -> null
          + default_service_version       = (known after apply)
            # (3 unchanged attributes hidden)

          ~ cors_rule {
              ~ allowed_origins    = [
                    "https://*.pip-frontend.test.platform.hmcts.net",
                  - "https://*.pip-frontend.ithc.platform.hmcts.net",
                ]
                # (4 unchanged attributes hidden)
            }

            # (6 unchanged blocks hidden)
        }

      ~ network_rules {
          ~ ip_rules                   = [] -> (known after apply)
          ~ virtual_network_subnet_ids = [] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

Plan: 12 to add, 7 to change, 12 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":160,"Program":"tfcmt","SHA1":"","Vars":{}} -->